# Переменные
team1_num = 5
team2_num = 6
score_1 = 40
score_2 = 42
team1_time = 1552.512
team2_time = 2153.31451
tasks_total = 82
time_avg = 45.2

# Определение переменной challenge_result в зависимости от условий
if score_1 > score_2 or (score_1 == score_2 and team1_time > team2_time):
    challenge_result = 'Победа команды Мастера кода!'
elif score_1 < score_2 or (score_1 == score_2 and team1_time < team2_time):
    challenge_result = 'Победа команды Волшебники данных!'
else:
    challenge_result = 'Ничья!'

# Использование %

# Пример итоговой строки: "В команде Мастера кода участников: 5 !"
str1 = "В команде Мастера кода участников: %d !" % team1_num

# Пример итоговой строки: "Итого сегодня в командах участников: 5 и 6 !"
str2 = "Итого сегодня в командах участников: %d и %d !" % (team1_num, team2_num)

# Использование format()

# Пример итоговой строки: "Команда Волшебники данных решила задач: 42 !"
str3 = "Команда Волшебники данных решила задач: {} !".format(score_2)

# Пример итоговой строки: "Волшебники данных решили задачи за 2153.3 с !"
str4 = "Волшебники данных решили задачи за {:.1f} с !".format(team2_time)

# Использование f-строк

# Пример итоговой строки: "Команды решили 40 и 42 задач.”
str5 = f"Команды решили {score_1} и {score_2} задач."

# Пример итоговой строки: "Результат битвы: победа команды Мастера кода!"
str6 = f"Результат битвы: {challenge_result}"

# Пример итоговой строки: "Сегодня было решено 82 задач, в среднем по 45.2 секунды на задачу!."
str7 = f"Сегодня было решено {tasks_total} задач, в среднем по {time_avg:.1f} секунды на задачу!."

# Печать всех строк для проверки
print(str1)
print(str2)
print(str3)
print(str4)
print(str5)
print(str6)
print(str7)